# TargetDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CameraInfo..::..TargetDistance Property
CameraInfo Class See Also
---
Distance from eye point along view direction to target plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double TargetDistance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TargetDistance As Double
	Get
```

Visual C++
---
```text
public:
property double TargetDistance {
	double get ();
}
```

# Remarks
This value is appropriate for perspective views only. Attempts to get this value for an orthographic view can be made, but the obtained value is to be ignored.
# See Also
CameraInfo Class
Autodesk.Revit.DB Namespace